{
    "informational-responses": {
        "100": {
            "name": "Continue",
            "description": "This interim response indicates that the client should continue the request or ignore the response if the request is already finished.",
            "status": ""
        },
        "101": {
            "name": "Switching Protocols",
            "description": "This code is sent in response to an Upgrade request header from the client and indicates the protocol the server is switching to.",
            "status": ""
        },
        "102": {
            "name": "Processing (WebDAV)",
            "description": "This code indicates that the server has received and is processing the request, but no response is available yet.",
            "status": ""
        },
        "103": {
            "name": "Early Hints",
            "description": "This status code is primarily intended to be used with the Link header, letting the user agent start preloading resources while the server prepares a response.",
            "status": ""
        }
    },
    "successful-responses": {
        "200": {
            "name": "OK",
            "description": "The request succeeded. The result meaning of 'success' depends on the HTTP method.",
            "status": ""
        },
        "201": {
            "name": "Created",
            "description": "The request succeeded, and a new resource was created as a result. This is typically the response sent after POST requests, or some PUT requests.",
            "status": ""
        },
        "202": {
            "name": "Accepted",
            "description": "The request has been received but not yet acted upon. It is noncommittal, since there is no way in HTTP to later send an asynchronous response indicating the outcome of the request. It is intended for cases where another process or server handles the request, or for batch processing.",
            "status": ""
        },
        "203": {
            "name": "Non-Authoritative Information",
            "description": "This response code means the returned metadata is not exactly the same as is available from the origin server, but is collected from a local or a third-party copy. This is mostly used for mirrors or backups of another resource. Except for that specific case, the 200 OK response is preferred to this status.",
            "status": ""
        },
        "204": {
            "name": "No Content",
            "description": "There is no content to send for this request, but the headers may be useful. The user agent may update its cached headers for this resource with the new ones.",
            "status": ""
        },
        "205": {
            "name": "Reset Content",
            "description": "Tells the user agent to reset the document which sent this request.",
            "status": ""
        },
        "206": {
            "name": "Partial Content",
            "description": "This response code is used when the Range header is sent from the client to request only part of a resource.",
            "status": ""
        },
        "207": {
            "name": "Multi-status (WebDAV)",
            "description": "Conveys information about multiple resources, for situations where multiple status codes might be appropriate.",
            "status": ""
        },
        "208": {
            "name": "Already Reported (WebDAV)",
            "description": "Used inside a <dav:propstat> response element to avoid repeatedly enumerating the internal members of multiple bindings to the same collection.",
            "status": ""
        },
        "226": {
            "name": "IM Used (HTTP Delta encoding)",
            "description": "The server has fulfilled a GET request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance.",
            "status": ""
        }
    },
    "redirection-messages": {
        "300": {
            "name": "Multiple Choices",
            "description": "The request has more than one possible response. The user agent or user should choose one of them. (There is no standardized way of choosing one of the responses, but HTML links to the possibilities are recommended so the user can pick.)",
            "status": ""
        },
        "301": {
            "name": "Moved Permanently",
            "description": "The URL of the requested resource has been changed permanently. The new URL is given in the response.",
            "status": ""
        },
        "302": {
            "name": "Found",
            "description": "This response code means that the URI of requested resource has been changed temporarily. Further changes in the URI might be made in the future. Therefore, this same URI should be used by the client in future requests.",
            "status": ""
        },
        "303": {
            "name": "See Other",
            "description": "The server sent this response to direct the client to get the requested resource at another URI with a GET request.",
            "status": ""
        },
        "304": {
            "name": "Not Modified",
            "description": "This is used for caching purposes. It tells the client that the response has not been modified, so the client can continue to use the same cached version of the response.",
            "status": ""
        },
        "305": {
            "name": "Use Proxy",
            "description": "Defined in a previous version of the HTTP specification to indicate that a requested response must be accessed by a proxy. It has been deprecated due to security concerns regarding in-band configuration of a proxy.",
            "status": "deprecated"
        },
        "306": {
            "name": "unused",
            "description": "This response code is no longer used; it is just reserved. It was used in a previous version of the HTTP/1.1 specification.",
            "status": "unused-reserved"
        },
        "307": {
            "name": "Temporary Redirect",
            "description": "The server sends this response to direct the client to get the requested resource at another URI with same method that was used in the prior request. This has the same semantics as the 302 Found HTTP response code, with the exception that the user agent must not change the HTTP method used: if a POST was used in the first request, a POST must be used in the second request.",
            "status": ""
        },
        "308": {
            "name": "Permanent Redirect",
            "description": "This means that the resource is now permanently located at another URI, specified by the Location: HTTP Response header. This has the same semantics as the 301 Moved Permanently HTTP response code, with the exception that the user agent must not change the HTTP method used: if a POST was used in the first request, a POST must be used in the second request.",
            "status": ""
        }
    },
    "client-error-responses": {
        "400": {
            "name": "Bad Request",
            "description": "The server cannot or will not process the request due to something that is perceived to be a client error (e.g., malformed request syntax, invalid request message framing, or deceptive request routing).",
            "status": ""
        },
        "401": {
            "name": "Unauthorized",
            "description": "Although the HTTP standard specifies \"unauthorized\", semantically this response means \"unauthenticated\". That is, the client must authenticate itself to get the requested response.",
            "status": ""
        },
        "402": {
            "name": "Payment Required",
            "description": "This response code is reserved for future use. The initial aim for creating this code was using it for digital payment systems, however this status code is used very rarely and no standard convention exists.",
            "status": "experimental"
        },
        "403": {
            "name": "Forbidden",
            "description": "The client does not have access rights to the content; that is, it is unauthorized, so the server is refusing to give the requested resource. Unlike 401 Unauthorized, the client's identity is known to the server.",
            "status": ""
        },
        "404": {
            "name": "Not Found",
            "description": "The server can not find the requested resource. In the browser, this means the URL is not recognized. In an API, this can also mean that the endpoint is valid but the resource itself does not exist. Servers may also send this response instead of 403 Forbidden to hide the existence of a resource from an unauthorized client. This response code is probably the most well known due to its frequent occurrence on the web.",
            "status": ""
        },
        "405": {
            "name": "Method Not Allowed",
            "description": "The request method is known by the server but is not supported by the target resource. For example, an API may not allow calling DELETE to remove a resource.",
            "status": ""
        },
        "406": {
            "name": "",
            "description": "",
            "status": ""
        },
        "407": {
            "name": "",
            "description": "",
            "status": ""
        },
        "408": {
            "name": "",
            "description": "",
            "status": ""
        },
        "409": {
            "name": "",
            "description": "",
            "status": ""
        },
        "410": {
            "name": "",
            "description": "",
            "status": ""
        },
        "411": {
            "name": "",
            "description": "",
            "status": ""
        },
        "412": {
            "name": "",
            "description": "",
            "status": ""
        },
        "413": {
            "name": "",
            "description": "",
            "status": ""
        },
        "414": {
            "name": "",
            "description": "",
            "status": ""
        },
        "415": {
            "name": "",
            "description": "",
            "status": ""
        },
        "416": {
            "name": "",
            "description": "",
            "status": ""
        },
        "417": {
            "name": "",
            "description": "",
            "status": ""
        },
        "418": {
            "name": "",
            "description": "",
            "status": ""
        },
        "421": {
            "name": "",
            "description": "",
            "status": ""
        },
        "422": {
            "name": "",
            "description": "",
            "status": ""
        },
        "423": {
            "name": "",
            "description": "",
            "status": ""
        },
        "424": {
            "name": "",
            "description": "",
            "status": ""
        },
        "425": {
            "name": "",
            "description": "",
            "status": ""
        },
        "426": {
            "name": "",
            "description": "",
            "status": ""
        },
        "428": {
            "name": "",
            "description": "",
            "status": ""
        },
        "429": {
            "name": "",
            "description": "",
            "status": ""
        },
        "431": {
            "name": "",
            "description": "",
            "status": ""
        },
        "451": {
            "name": "",
            "description": "",
            "status": ""
        }
    },
    "server-error-responses": {
        "500": {
            "name": "",
            "description": "",
            "status": ""
        },
        "501": {
            "name": "",
            "description": "",
            "status": ""
        },
        "502": {
            "name": "",
            "description": "",
            "status": ""
        },
        "503": {
            "name": "",
            "description": "",
            "status": ""
        },
        "504": {
            "name": "",
            "description": "",
            "status": ""
        },
        "505": {
            "name": "",
            "description": "",
            "status": ""
        },
        "506": {
            "name": "",
            "description": "",
            "status": ""
        },
        "507": {
            "name": "",
            "description": "",
            "status": ""
        },
        "508": {
            "name": "",
            "description": "",
            "status": ""
        },
        "510": {
            "name": "",
            "description": "",
            "status": ""
        },
        "511": {
            "name": "",
            "description": "",
            "status": ""
        }
    }
}